# Generate by ChatGPT

URL: https://chatgpt.com/share/67fd9342-7fa0-8007-b0a2-439ba1c75738

In [257]:
import pandas as pd
import sqlalchemy

from sqlalchemy import create_engine, text

In [258]:
engine = create_engine('sqlite:///:memory:')

In [259]:
df_employees = pd.read_csv('../../data/employees.csv')

### 1. Liste todos os funcionários que ganham mais de 6000.

In [260]:
# Filtrando apenas os funcionários que ganham mais de 6000 no DataFrame

df_employees.query('salary > 6000')

   id   name  department_id  salary
0   1  Alice              1    7000
3   4  Diana              2    6500

In [261]:
# Cria uma tabela em memória chamada 'employees' [Se já existir, ela substitui a antiga]


df_employees.to_sql('employees', con=engine, if_exists='replace')

5

In [262]:
# Query a ser feita

q = 'SELECT * from employees WHERE salary > 6000'

In [263]:
# Executa o texto da Query no banco de dados

with engine.connect() as conn:
  conn.execute(text(q))
  conn.commit()

In [264]:
# Lê o SQL da query do banco de dados

pd.read_sql(q, con=engine)

   index  id   name  department_id  salary
0      0   1  Alice              1    7000
1      3   4  Diana              2    6500

#### 2. Recupere o funcionário com id = 3.

In [265]:
df_employees

   id     name  department_id  salary
0   1    Alice              1    7000
1   2      Bob              1    5000
2   3  Charlie              2    6000
3   4    Diana              2    6500
4   5   Edward              3    5500

In [266]:
# Busca pelo ID 3

df_employees.loc[df_employees['id'] == 3]
# df_employees.query('id == 3')

   id     name  department_id  salary
2   3  Charlie              2    6000

In [267]:
q = 'select * from employees where id = 3'

In [268]:
with engine.connect() as conn:
  conn.execute(text(q))
  conn.commit()

In [269]:
pd.read_sql_query(q, con=engine)

   index  id     name  department_id  salary
0      2   3  Charlie              2    6000

#### 3. Exercício 2 – Filtro por Faixa de Salário

- Liste os funcionários cujo salário está entre 5500 e 7000 (inclusive).

In [270]:
df_employees.query('salary >= 5500 and salary <= 7000')

   id     name  department_id  salary
0   1    Alice              1    7000
2   3  Charlie              2    6000
3   4    Diana              2    6500
4   5   Edward              3    5500

In [271]:
q = 'SELECT * from employees where salary between 5500 and 7000'

In [272]:
with engine.connect() as conn:
  conn.execute(text(q))
  conn.commit()

In [273]:
pd.read_sql_query(q, con=engine)

   index  id     name  department_id  salary
0      0   1    Alice              1    7000
1      2   3  Charlie              2    6000
2      3   4    Diana              2    6500
3      4   5   Edward              3    5500

#### 3. Filtro por Nome com LIKE

- Encontre todos os funcionários cujo nome começa com a letra “D”.

In [274]:
# Com pandas no Dataframe

df_employees[df_employees['name'].str.startswith('D', na=False)]

   id   name  department_id  salary
3   4  Diana              2    6500

In [275]:
q = 'select * from employees where name like "D%"'

In [276]:
with engine.connect() as conn:
  conn.execute(text(q))
  conn.commit()

In [277]:
pd.read_sql_query(q, con=engine)

   index  id   name  department_id  salary
0      3   4  Diana              2    6500

### 4. Filtro por Vários IDs

- Recupere os funcionários com os seguintes IDs: 1, 3 e 5.

In [278]:
df_employees[df_employees['id'].isin([1,3,5])]

   id     name  department_id  salary
0   1    Alice              1    7000
2   3  Charlie              2    6000
4   5   Edward              3    5500

In [279]:
q = 'select * from employees where id in (1,3,5)'

In [280]:
with engine.connect() as conn:
  conn.execute(text(q))
  conn.commit()

In [281]:
pd.read_sql_query(q, con=engine)

   index  id     name  department_id  salary
0      0   1    Alice              1    7000
1      2   3  Charlie              2    6000
2      4   5   Edward              3    5500

#### 5. Altere (no DataFrame, não no arquivo) o salário de todos os funcionários do departamento 2 para 7000.

In [282]:
# Altera na linha do department_id 2 para o salário de 7000.

# .loc[linhas, colunas] = valor

df_employees.loc[df_employees['department_id'] == 2, 'salary'] = 7000

df_employees

   id     name  department_id  salary
0   1    Alice              1    7000
1   2      Bob              1    5000
2   3  Charlie              2    7000
3   4    Diana              2    7000
4   5   Edward              3    5500

In [283]:
q = 'update '

In [284]:
with engine.connect() as conn:
  conn.execute(text(q))
  conn.commit()

OperationalError: (sqlite3.OperationalError) incomplete input
[SQL: update ]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [ ]:
pd.read_sql_query(q, con=engine)

   index  id     name  department_id  salary
0      0   1    Alice              1    7000
1      1   2      Bob              1    5000
2      2   3  Charlie              2    6000
3      3   4    Diana              2    6500
4      4   5   Edward              3    5500